.no-mistakes/evidence/mguilarducci/tha-20-load-test-the-ingestion-endpoint-with-thousands-of-requests/smoke.txt
== building release server ==
   Compiling proc-macro2 v1.0.106
   Compiling unicode-ident v1.0.24
   Compiling quote v1.0.46
   Compiling libc v0.2.186
   Compiling pin-project-lite v0.2.17
   Compiling itoa v1.0.18
   Compiling find-msvc-tools v0.1.9
   Compiling futures-core v0.3.32
   Compiling shlex v2.0.1
   Compiling bytes v1.12.0
   Compiling once_cell v1.21.4
   Compiling serde_core v1.0.228
   Compiling pkg-config v0.3.33
   Compiling log v0.4.33
   Compiling tracing-core v0.1.36
   Compiling http v1.4.2
   Compiling cfg-if v1.0.4
   Compiling serde v1.0.228
   Compiling memchr v2.8.2
   Compiling alloc-no-stdlib v2.0.4
   Compiling zstd-safe v7.2.4
   Compiling crc32fast v1.5.0
   Compiling alloc-stdlib v0.2.4
   Compiling ident_case v1.0.1
   Compiling zmij v1.0.21
   Compiling errno v0.3.14
   Compiling socket2 v0.6.4
   Compiling jobserver v0.1.34
   Compiling signal-hook-registry v1.4.8
   Compiling mio v1.2.1
   Compiling syn v2.0.118
   Compiling http-body v1.0.1
   Compiling cc v1.2.65
   Compiling strsim v0.11.1
   Compiling simd-adler32 v0.3.9
   Compiling adler2 v2.0.1
   Compiling httparse v1.10.1
   Compiling tower-service v0.3.3
   Compiling miniz_oxide v0.8.9
   Compiling brotli-decompressor v5.0.3
   Compiling prettyplease v0.2.37
   Compiling percent-encoding v2.3.2
   Compiling smallvec v1.15.2
   Compiling serde_json v1.0.150
   Compiling tower-layer v0.3.3
   Compiling rustversion v1.0.22
   Compiling zstd-sys v2.0.16+zstd.1.5.7
   Compiling futures-task v0.3.32
   Compiling slab v0.4.12
   Compiling futures-util v0.3.32
   Compiling flate2 v1.1.9
   Compiling brotli v8.0.4
   Compiling http-body-util v0.1.3
   Compiling futures-channel v0.3.32
   Compiling sync_wrapper v1.0.2
   Compiling httpdate v1.0.3
   Compiling compression-core v0.4.32
   Compiling regex-syntax v0.8.11
   Compiling atomic-waker v1.1.2
   Compiling anyhow v1.0.102
   Compiling darling_core v0.23.0
   Compiling regex-automata v0.4.14
   Compiling tokio-macros v2.7.0
   Compiling tokio v1.52.3
   Compiling tracing-attributes v0.1.31
   Compiling darling_macro v0.23.0
   Compiling darling v0.23.0
   Compiling tracing v0.1.44
   Compiling form_urlencoded v1.2.2
   Compiling lazy_static v1.5.0
   Compiling ryu v1.0.23
   Compiling thiserror v2.0.18
   Compiling mime v0.3.17
   Compiling time-core v0.1.9
   Compiling num-conv v0.2.2
   Compiling futures-sink v0.3.32
   Compiling time-macros v0.2.30
   Compiling axum-core v0.5.6
   Compiling serde_urlencoded v0.7.1
   Compiling bon-macros v3.9.3
   Compiling sharded-slab v0.1.7
   Compiling matchers v0.2.0
   Compiling axum-macros v0.5.1
   Compiling hyper v1.10.1
   Compiling hyper-util v0.1.20
   Compiling tokio-util v0.7.18
   Compiling tower v0.5.3
   Compiling derive_more-impl v2.1.1
   Compiling thiserror-impl v2.0.18
   Compiling tracing-serde v0.2.0
   Compiling serde_path_to_error v0.1.20
   Compiling tracing-log v0.2.0
   Compiling thread_local v1.1.9
   Compiling deranged v0.5.8
   Compiling powerfmt v0.2.0
   Compiling bitflags v2.13.0
   Compiling matchit v0.8.4
   Compiling dotenvy v0.15.7
   Compiling nu-ansi-term v0.50.3
   Compiling countingsheep_env_vars v0.1.0 (/Users/mguilarducci/.no-mistakes/worktrees/c9eb02a1e540/01KW30A824V3045GKAY1S5X7TA/crates/countingsheep_env_vars)
   Compiling tracing-subscriber v0.3.23
   Compiling axum v0.8.9
   Compiling bon v3.9.3
   Compiling time v0.3.51
   Compiling derive_more v2.1.1
   Compiling zstd v0.13.3
   Compiling compression-codecs v0.4.38
   Compiling async-compression v0.4.42
   Compiling tower-http v0.7.0
   Compiling countingsheep v0.1.0 (/Users/mguilarducci/.no-mistakes/worktrees/c9eb02a1e540/01KW30A824V3045GKAY1S5X7TA)
    Finished `release` profile [optimized] target(s) in 41.02s
== starting server (PORT=8891 RUST_LOG=info) ==
Listening at http://127.0.0.1:8891
server healthy at http://127.0.0.1:8891


         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: /Users/mguilarducci/.no-mistakes/worktrees/c9eb02a1e540/01KW30A824V3045GKAY1S5X7TA/loadtest/k6/smoke.js
        output: -

     scenarios: (100.00%) 1 scenario, 1 max VUs, 10m30s max duration (incl. graceful stop):
              * default: 1 iterations shared among 1 VUs (maxDuration: 10m0s, gracefulStop: 30s)

2026-06-26T22:31:52.371005Z  INFO countingsheep::ingest::handler: sheep accepted id=sheep-1-0-vjnnsbbs source=/loadtest event_type=usage.created occurred_at=2026-06-26 22:31:52.370989 +00:00:00 received_at=2026-06-26 22:31:52.370989 +00:00:00
2026-06-26T22:31:52.371232Z  INFO countingsheep::ingest::handler: sheep accepted id=sheep-1-0-1ntv4xzr source=/loadtest event_type=usage.created occurred_at=2026-06-26 22:31:52.371231 +00:00:00 received_at=2026-06-26 22:31:52.371231 +00:00:00
2026-06-26T22:31:52.371238Z  INFO countingsheep::ingest::handler: sheep accepted id=sheep-1-0-lfcn6ky8 source=/loadtest event_type=usage.created occurred_at=2026-06-26 22:31:52.371231 +00:00:00 received_at=2026-06-26 22:31:52.371231 +00:00:00
2026-06-26T22:31:52.371244Z  INFO countingsheep::ingest::handler: sheep accepted id=sheep-1-0-183mth9p source=/loadtest event_type=usage.created occurred_at=2026-06-26 22:31:52.371231 +00:00:00 received_at=2026-06-26 22:31:52.371231 +00:00:00


  █ THRESHOLDS 

    checks
    ✓ 'rate==1.0' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 10      5387.931034/s
    checks_succeeded...: 100.00% 10 out of 10
    checks_failed......: 0.00%   0 out of 10

    ✓ health 200
    ✓ health says ok
    ✓ 202
    ✓ empty body
    ✓ 400
    ✓ detail is "id is required"
    ✓ 415
    ✓ 405
    ✓ 404

    HTTP
    http_req_duration..............: avg=136.28µs min=110µs  med=120µs  max=201µs  p(90)=180.6µs p(95)=190.8µs
      { expected_response:true }...: avg=162.66µs min=120µs  med=167µs  max=201µs  p(90)=194.2µs p(95)=197.6µs
    http_req_failed................: 57.14% 4 out of 7
    http_reqs......................: 7      3771.551724/s

    EXECUTION
    iteration_duration.............: avg=1.78ms   min=1.78ms med=1.78ms max=1.78ms p(90)=1.78ms  p(95)=1.78ms 
    iterations.....................: 1      538.793103/s

    NETWORK
    data_received..................: 1.1 kB 594 kB/s
    data_sent......................: 1.5 kB 801 kB/s



running (00m00.0s), 0/1 VUs, 1 complete and 0 interrupted iterations
default ✓ [ 100% ] 1 VUs  00m00.0s/10m0s  1/1 shared iters
Server has gracefully shut down!